#include <stdio.h>

int main()
{
    /*
    int arr[5];整形数组
    int *parr1[10];整形指针的数组
    int (*parr2)[10];数组指针,该指针能指向一个数组,数组十个元素,每个元素是int类型
    int (*parr3[10])[5];存放数组指针的数组,该数组能够存放10个数组指针,每个数组指针能指向一个数组,
    数组元素五个,每个都是int类型
    */
    //指针数组
    int* arr[4];//存放指针的数组
    int a = 10;
    int b = 20;
    int c = 30;

    int* arr[3] = {&a,&b,&c};
    int i = 0;
    for (i = 0; i < 3; i++)
    {
        printf("%d ",*(arr[i]));
    }


    int a1[5] = {1,2,3,4,5}; 
    int b1[] = {2,3,4,5,6};
    int c1[] = {3,4,5,6,7};
    int* arr3[3] = {&a1,&b1,&c1};

    //数组名是数组首元素的地址
    //例外:1.sizeof(数组名),计算整个数组的大小
    //2.&数组名,表示取出整个数组的地址


    return 0;
}